Repository: maabou512/ospo_paper2021
Catalog: LFResearch_OSPO_Report Folder/omegaT_Rainbow/pack1/pack1-level2.tmx
Source language: en_us
Languages: ja_jp

source: Only when we can’t find something that close will we consider a proprietary vendor or something we don’t consider to be open.”
ja_jp: それに近いものが見つからない場合に限り、プロプライエタリなベンダーや、オープンとはみなされないものを検討することになるでしょう。」

source: Open Source First
ja_jp: オープンソースファースト

source: Open Source First 20
ja_jp: オープンソース ファースト 20

source: Open Source across Industries
ja_jp: 業種横断のオープンソース

source: Open source first OSPOs are acutely aware of trends in copyleft licensing and other restrictive forms of open source licensing.
ja_jp: オープンソース ファーストである OSPO は、 コピーレフト ライセンス やその他制約が強いオープンソース ライセンスのトレンドに鋭い眼識を持っています。

source: Organizations that cross this threshold and successfully launch multiple open source projects develop internal resources and processes that can incubate and ensure the success of these projects post launch.
ja_jp: この「しきい」を越え、多発的にオープンソースプロジェクト成功裏に立ち上げる組織は、立ち上げたその後でこういったプロジェクトをインキュベートし、その成功を確実にできるよう内部リソースとプロセスを発展させていきます。

source: Our job is to make it easy to make it work in OSS.
ja_jp: 私たちの仕事は、OSSにおいて機能させること、それを容易にすることです。

source: Outside the technology sector, fewer organizations can assign FTEs to open source work, but they are doing it.
ja_jp: テック部門以外では、フィルタイムの社員たちをオープンソースの仕事に割り当てることができる組織はほとんどありませんが、彼らもまたそれを行おうとしています。

source: Over time, OSPOs have evolved from engaging in existing projects to generating and launching projects to the broader community.
ja_jp: 時がたつにつれ、OSPO は既存プロジェクトへエンゲージメントをする立場から、プロジェクトの創出と立ち上げより広範なコミュニティに向かっていくよう進化してきました。

source: Over time, the OSPO practice at Comcast is evolving to become both more proactive and more strategic.
ja_jp: 時とともに、Comcast の OSPO の取り組みは、よりプロアクティブで戦略的になるべく進化をし続けています。

source: Over time, we’ve witnessed greater open source adoption, contribution, and community-wide participation, with much support from newly established OSPOs.
ja_jp: 私たちは、時間の経過とともに、新たに設立された OSPO から多くの支援を受けたことで、より際立ったオープンソースの採用やコントリビューション活動、そしてコミュニティ全体にわたる参加を目の当たりにしてきました。

source: Overall, recognize the value of OSS and the need for compliance, education, and an SBOMs
ja_jp: 全体にわたり、OSSの価値、コンプライアンス、教育、SBOMといったことの必要性を認識する

source: Part of the Volkswagen Group, Porsche uses open source software primarily for embedded systems, such as electronic control units, and for consumer-facing mobile / web applications.
ja_jp: Volkswagen グループの一部である Porsche は、電子制御ユニットなどの組み込みシステムや、消費者が直接対面するモバイル/ウェブアプリケーションとしてオープンソースソフトウェアを第一選択肢として使っています。

source: Peters himself reports to the Porsche CPO.
ja_jp: 現在 Peters 自身が Porsche CPO の直属となっています。

source: Peters points out that while the average car made by traditional manufacturers has dozens of electronic control units (ECUs), each with a different bit of software, cars made by Tesla only have two ECUs.
ja_jp: Peters は、伝統的メーカーが製造する平均的な車両には数十の電子制御ユニット（ECU）があり、それぞれに異なるソフトウェアが付随しているのに対し、Tesla が作る車両には ECU が2つしかない、ということを指摘しています。

source: Plays a key role in evaluating viable open source technologies and helping the organization’s CTO and vice president of engineering to lay out a technology roadmap.
ja_jp: 実効性のあるオープンソースの技術を評価し、その組織の CTO およびエンジニアリング担当 VP がテクノロジー ロードマップを作成するのを支援する重要な役割を担う

source: Porsche developers are participants but not yet heavy contributors, outside of a handful of efforts.
ja_jp: Porsche の開発者たちは、参加こそしているものの、一握りの取り組みを除けば、まだ大きなコントリビューションをしているわけではないそうです。

source: Porsche is working with developers from Bosch, Here Technologies, and other automotive industry companies and software companies in the European Union.
ja_jp: 今 Porsche は、Bosch、Here Technologies、その他EUの自動車産業の企業やソフトウェア企業と連携しています。

source: Porsche started the pre-OSPO effort in 2018 with the launch of a formal OSPO in 2020.
ja_jp: Porsche は2018年から「プレ OSPO」の取り組みを始め、2020年には正式な OSPO を立ち上げました。

source: Prefers holistic approach
ja_jp: 全体的なアプローチを好む

source: Processes, procedures, and tools are in place to streamline and facilitate open source consumption and participation.
ja_jp: オープンソース（へ）の消費や参加を合理化し促進するためのプロセス、手順、ツールが整備されている

source: Prominent Projects Incubated
ja_jp: インキュベートされた重要プロジェクト

source: Providing strategic and tactical guidance on how an organization should guide employee participation in open source and which projects to support
ja_jp: 社員のオープンソースへの参加を組織がどう導くべきか、どのプロジェクトをサポートすべきかといったことに関する、戦略的かつ戦術的なガイダンスの提供

source: Rare OSPOs that form or facilitate the formation of large, complex open source projects inside an organization and then launch them as publicly available projects
ja_jp: 組織内で大規模で複雑なオープンソース プロジェクトを形成、その促進をし、公開可能なプロジェクトとしてローンチするOSPO部門。ただし比較的少数

source: Rather, when a big project does launch, the company usually donates it to a foundation as part of the launch.
ja_jp: むしろ、大きなプロジェクトがローンチされるときには、そういった企業が立ち上げの一環で財団（Foundation）へ寄贈するのが通常です。

source: Red Hat reported that “90% of IT leaders are using enterprise open source.” Software composition analysis vendors like Synopsys determined that over 75% of all codebases contained open source components.
ja_jp: Red Hatは、「ITリーダーの90%がエンタープライズ オープンソースを使用している」と報告しています。Synopsys のようなソフトウェア コンポジション解析のベンダー企業が、すべてのコードベースの75%以上がオープンソースコンポーネントを含んでいると断定しています。

source: Reduce costs of software development
ja_jp: ソフトウェア開発コストを削減すること

source: Reduce time to market of products and innovation through open source
ja_jp: オープンソースを通じ、製品およびイノベーションの Time-To-Market を短くすること

source: Reports to
ja_jp: レポート先

source: Respondents came from a wide variety of industries, including education, telecommunications, media, financial services, government, transportation and automotive, health care, and retail.
ja_jp: 回答者は、教育、通信、メディア、金融サービス、政府機関、運輸、自動車、ヘルスケア、小売など、さまざまな業種に属しています。

source: Respondents were twice as likely as last year to believe that funding for their company’s open source initiatives would increase this fiscal year because of macroeconomic conditions.
ja_jp: マクロ経済の状況を理由に、自社のオープンソース関連のイニシアチブに対するファンディングが今年度は増加すると答えた回答者が昨年の2倍となりました。

source: Risk mitigation strategies include careful licensing, developer education, and rigorous inventory-taking.
ja_jp: リスク低減のための戦略としては、ライセンシングにおける配慮、開発者教育、および厳密なインベントリ作成が含まれます。

source: SBOM Innovators have 43% higher revenue than SBOM Procratinators
ja_jp: SBOMを積極導入したイノベーターたちの収入はSBOM導入をためらう人たちよりは43%多い

source: Said Fleming,
ja_jp: と、 Fleming は言います。

source: Semiconductor companies such as Intel and Qualcomm fit this description.
ja_jp: Intel や Qualcomm などの半導体メーカーがこれに合致します。

source: Set up specific software inventory processes to create an organization-wide software bill of materials (SBOM)
ja_jp: 組織全体でのソフトウェア部品表（SBOM）を作成するための、具体的なソフトウェアインベントリ プロセスを設定する

source: Several employees work full-time on open source code, a higher bar to clear at Bloomberg, as employees generally must justify to their managers that full-time work on a community project delivers clear value and utility to the company.
ja_jp: Bloomberg では、社員の何人かはフルタイムでオープンソース コードへ取り組んでいますが、一般的にコミュニティのプロジェクトでフルタイムで働くことがその企業に明らかな価値と有用性をもたらす、ということをマネージャたちに正当化できなければなりません。これはクリアするには高いハードルなのです。

source: Should we use this particular project from this community?
ja_jp: 「このコミュニティのこのプロジェクトを使うべきなのか?」

source: Significant numbers of employees are contributing code to open source projects.
ja_jp: 多くの社員がオープンソースプロジェクトにコードをコントリビュートしている

source: Since 2020, Porsche’s OSPO has rapidly expanded its participation in open source.
ja_jp: 2020年以来、Porsche の OSPO はオープンソースへの参画を急速に拡大してきました。

source: Since inception, there have been two primary goals of the Comcast OSPO.
ja_jp: 設立以来 Comcast の OSPO は主に2つの目標を掲げています。

source: Since then, Comcast has not only contributed to several projects used by the company, but has also posted dozens of open source repositories on GitHub and released multiple projects.
ja_jp: それ以来、Comcast は同社が使用するいくつかのプロジェクトにコントリビュートしてきただけでなく、GitHub 上に数十のオープンソースリポジトリを公開し、いくつもののプロジェクトをリリースしてきました。

source: So they must identify their legal and security risks.
ja_jp: そのため、彼らにとっての法的およびセキュリティ上のリスクは明確にしなければならないのです。

source: Software Company
ja_jp: ソフトウェア企業

source: Software Company 21
ja_jp: ソフトウェア企業 21

source: Some leading organizations, such as Comcast, VMware, and Red Hat, have built or are building advanced metrics and measurement tooling.
ja_jp: Comcast、VMware、Red Hatといった先進的企業 では、高度なメトリックや測定ツールを構築済みのところもあれば、まさに構築しようとしているところもあります。

source: Some OSPOs prefer to launch projects with the assis tance of the major open source foundations or collaboratives, such as the TODO Group, to enhance capabilities or provide infra structure, tac tical assistance, and other resources.
ja_jp: OSPO の中には、主要なオープンソースの財団や TODO Group などの協力機関の支援 のもとでプロジェクトを立ち上げ、ケイパビリティを高め、インフラ 、戦術的 な支援、その他リソースを提供したりするやり方を好むところもあります。

source: Some contribution metrics and best practices
ja_jp: いくつかのコントリビューションに関するメトリクスとベストプラクティス

source: Some of the organizations we spoke with now include specific metrics for open source participation and usage.
ja_jp: 私たちが話をした中には、オープンソースの参加と使用に関する具体的メトリックを現時点で組み入れているという組織もありました。

source: Sometimes the organization introduces a formal CLA policy at this stage.
ja_jp: 組織はこのステージで、正式な CLA ポリシーを導入することがあります。

source: Source: Cloud Native Computing Foundation, accessed 22 Feb.
ja_jp: 出典：Cloud Native Computing Foundation、

source: Source: OSPO Survey 2021
ja_jp: 出典：OSPO Survey 2021

source: Source: TODO Group
ja_jp: 出典：TODO Group

source: Sponsorship of the creation of this report does not constitute an endorsement of its findings by any of its sponsors.
ja_jp: 本レポート作成におけるスポンサーであることは、本レポートの調査結果についてそのスポンサーが支持するものではありません。

source: Stage 0: Adopting Open Source Ad Hoc
ja_jp: ステージ0：オープンソースのアドホックな採用

source: Stage 0: Adopting Open Source Ad Hoc 10
ja_jp: ステージ0：オープンソースのアドホックな採用 10

source: Stage 1
ja_jp: ステージ1

source: Stage 1 organizations set up specific software inventory processes to create an organization-wide software bill of materials (SBOM).
ja_jp: ステージ1の段階にある組織は、具体的なソフトウェアインベントリ プロセスを起こし、組織全体のソフトウェア部品表（SBOM）を作成します。

source: Stage 1: Providing OSS Compliance, Inventory, and Developer Education
ja_jp: ステージ1：OSSコンプライアンス、インベントリ、および開発者教育の提供

source: Stage 1: Providing OSS Compliance, Inventory, and Developer Education 11
ja_jp: ステージ1：OSSコンプライアンス、インベントリ、および開発者教育の提供 11

source: Stage 2
ja_jp: ステージ2

source: Stage 2: Evangelizing OSS Use and Ecosystem Participation
ja_jp: ステージ2：OSSの使用とエコシステムへの参加の啓発

source: Stage 2: Evangelizing OSS Use and Ecosystem Participation 12
ja_jp: ステージ2：OSSの使用とエコシステムへの参加の啓発 12

source: Stage 3
ja_jp: ステージ3

source: Stage 3: Hosting OSS Projects and Growing Communities
ja_jp: ステージ3：OSSプロジェクトをホストとコミュニティの育成

source: Stage 3: Hosting OSS Projects and Growing Communities 14
ja_jp: ステージ3：OSSプロジェクトのホストとコミュニティの育成 14

source: Stage 4
ja_jp: ステージ4

source: Stage 4: Becoming a Strategic Decision-Making Partner
ja_jp: ステージ4：戦略的意思決定のパートナー化

source: Stage 4: Becoming a Strategic Decision-Making Partner 15
ja_jp: ステージ4:戦略的意思決定のパートナー化 15

source: Stormy Peters, Zoom interview with author, Nov.
ja_jp: Stormy Peters、著者による Zoom インタビュー、

source: Such an inventory itemizes OSS in organization’s code repositories (e.g., GitHub, GitLab) and systems.
ja_jp: このようなインベントリによって、組織のコードリポジトリ（例：GitHub、GitLab）やシステムにある OSS が項目リスト化されていきます。

source: Such developer efficiency may include simplifying CLAs, adding OSS with acceptable license types to ticketing systems for fast approval, promoting reuse of OSS architecture and software in place (a variation on inner-sourcing), and standardizing library selection and open source development tools, thereby blending OSPO and platform operations duties.
ja_jp: そういった開発者の効率面としては、CLA の簡素化、チケッティングシステムへ許容可能なライセンスタイプの OSS を追加する仕組みによる承認の迅速化、OSS アーキテクチャやソフトウェアの再利用の促進（別形態のインナーソーシング）、ライブラリの選択やオープンソース開発ツールの標準化、といったものがあり、結果として OSPO とプラットフォームの運用業務が「混ざり合う」ことになります。

source: Such growth is not without growing pains.
ja_jp: このような成長には痛みが伴うものです。

source: Such projects tend to offer better performance and economics on crucial capabilities that may be noncore to the orga ni zation’s value proposition but critical to its technology infrastructure.
ja_jp: このようなプロジェクトは、重要なケイパビリティ ― 組織のバリュー プロポジション（Value proposition：価値提案/価値命題）の中核ではなくとも、テクノロジーのインフラで必要不可欠の大事なケイパビリティ ― として、より優れたパフォーマンスや経済性を発揮することに繋がります。

source: Supporting a project with FTEs and funding is true skin in the open source game.
ja_jp: フルタイムの従業員とファンディングによってプロジェクトをサポートすることは、オープンソースにおける「成果を得るための真の投資（True skin in the game）」なのです。

source: Survey Methodology and Respondent Composition
ja_jp: 調査方法と回答者構成について

source: Survey Methodology and Respondent Composition 6
ja_jp: 調査方法と回答者構成について 6

source: Suzanne Ambiel (Director, Open Source Marketing and Strategy, VMware), Zoom interview with author, Oct.
ja_jp: Suzanne Ambiel（Director,Open Source Marketing and Strategy,VMware）、著者による Zoom インタビュー、

source: TODO is an open group of organizations that collaborate on practices, tools, and other ways to run successful and effective open source projects and programs.
ja_jp: TODO グループは、オープンソース プロジェクトやオープンソース プログラムを首尾よく、かつ効果的に運営するためのプラクティスの紹介、ツールおよび各種手法についてコラボレーションする、オープンな組織グループ です。

source: Table 1
ja_jp: 表1

source: Take the lead on benchmarking what constitutes an acceptable OSS project
ja_jp: 受け入れることができそうな OSS プロジェクトのベンチマークをリードする

source: Taking Software Inventory
ja_jp: ソフトウェアインベントリを取得する

source: Technology Strategy Experts
ja_jp: 技術戦略 エキスパート

source: Technology Strategy Experts 21
ja_jp: 技術戦略のエキスパート 21

source: Thanks to all the participants in this study who generously spent time speaking with us and reviewing sections of the report, including Deborah Bryant, Chris Xie, Dirk Riehle, Kevin Fleming, Alyssa Wright, Robyn “Stormy” Peters, Suzanne Ambiel, Nikita Peters, Michael Picht, and Peter Giese.
ja_jp: この調査に参加し、私たちとの対話や、本レポートの各セクションのレビューに惜しみなく時間を費やしてくれた、Deborah Bryant、Chris Xie、Dirk Riehle、Kevin Fleming、Alyssa Wright、Robyn “Stormy” Peters、Suzanne Ambiel、Nikita Peters、 Michael Picht、 Peter Giese をはじめとするすべての方に感謝いたします。

source: That said, even some sophisticated organizations that are tracking metrics do not use metrics explicitly to track or set OSS goals.
ja_jp: とは言うものの、メトリックを追跡しているような洗練された組織でさえ、「OSSとしての」ゴールを追跡したり設定したりするべく、メトリックを明示的に使用していないところもあります。

source: That said, inner sourcing software may be a test run for later open-sourcing the same software.
ja_jp: そうは言っても、インナーソーシング ソフトウェアは、後に同じソフトウェアをオープンソース化するための「テストラン」になるかもしれません。

source: That said, our conversations with OSPO leaders and the survey responses indicate that, if anything, organizations are planning to expand OSPO budgets and mandates, mirroring the growth of open source.
ja_jp: いずれにしても 今回私たちが行った OSPO のリーダーたちとの対話やサーベイ回答では、オープンソースの成長を反映するように OSPO の予算や権限を拡大していく計画があることを示していました。

source: The 2021 survey found that 58% of OSPOs are formally structured, up from 54% in 2020.
ja_jp: 2021年の調査では、OSPO の58%が体制上の（形式的な）組織となっており、2020年の54%から増加していることがわかりました。

source: The Comcast OSPO Journey
ja_jp: Comcast の OSPO の「旅」

source: The Comcast OSPO also collects detailed metrics on the impact of open source and inner source efforts including contributions processed and type of contributions, events (sponsored, attended, internal, user groups, etc.), blog and article publications, compliance automations, and consultations.
ja_jp: Comcast の OSPO はまた、実際のコントリビューションやその種類、イベント（スポンサリング、直接参加、社内開催、ユーザグループの集まり等）、ブログや記事の公開、コンプライアンスの自動化、コンサルティングといった、オープンソースやインナーソースの活動の影響に関する、詳細なメトリックを収集しています。

source: The Comcast OSPO has a valuable role to play to guide the organization on technology trends, changing license and open source directions, and best practices.
ja_jp: Comcast のOSPO は、技術のトレンド、ライセンスとオープンソースの方向性の変化、ベストプラクティスについて自社をガイドする貴重な役割を担っています。

source: The Cs inform Comcast open source practices, from working with other companies in the TODO Group and OpenChain to participating and sponsoring open source foundations, to creating an internal mindset and culture of open source.
ja_jp: これらの「C」は、TODO Group や OpenChain における他企業との協働から、オープンソース財団への参加、スポンサリング、社内のオープンソースのマインドセットやカルチャーの創出に至る、Comcast のオープンソースのプラクティスを伝えています。

source: The Evolution of the Open Source Program Office (OSPO)
ja_jp: Open Source Program Office（OSPO）の進化

source: The Five-Stage OSPO Maturity Model
ja_jp: 5段階の OSPO 成熟度モデル

source: The Five-Stage OSPO Maturity Model 9
ja_jp: 5段階の OSPO 成熟度モデル 9

source: The OSPO concept is now about two decades old, but really started to accelerate in the last decade or so.
ja_jp: OSPO のコンセプトはできてから20年ほど経ったものですが、まさにこの10年ほどで加速しはじめました。

source: The OSPO helps people do that consistently and confidently, be it for speaking at a conference or contributing a small library to participating in a big project community, such as Kubernetes.
ja_jp: OSPO は、人々が一貫した形で自信を持って活動 ― カンファレンスで発言であったり、Kubernetes のような大きなプロジェクトコミュニティへの参加に向けた小さなライブラリのコントリビューションだったり、そういった活動 ― をすることを支援するのです。

source: The OSPO is growing to fill these new larger shoes, serving as an internal consultancy, a center of excellence, and a trusted advisor and mentor.
ja_jp: OSPO は、こういった新しく大きな役割を果たすために成長しており、内部コンサルタント、CoE（Center of Excellence）、信頼のおけるアドバイザーおよびメンターとして機能しています。

source: The OSPO often evaluates the behavior and performance of the project, especially changes in license type that limit usage, or abrupt shifts in the project roadmap, to determine whether a project manager has the best interests of the community in mind.
ja_jp: OSPO はしばしば、プロジェクトの動向やパフォーマンス、特に使用を制限するライセンスタイプの変更やプロジェクト ロードマップの突発的な変更などを評価し、プロジェクトマネージャの頭の中でコミュニティに最大の関心が置かれているのかどうか、判定します。

source: The Porsche OSPO Journey
ja_jp: Porsche における OSPO の「旅」

source: The Porsche OSPO is organized around the concept of “coordinators” who sit inside of product teams and support the OSPO.
ja_jp: Porsche の OSPO は、製品チームの中に入り、そこから OSPO をサポートする、「コーディネーター」のコンセプトに基づいて組織されています。

source: The TODO Group exists to foster best practices in OSS usage and community building.
ja_jp: 「TODO Group」は、OSS の使用とコミュニティ構築におけるベストプラクティスを推進するために存在します。

source: The big project also plays a key strategic technology role for the OSPO’s parent organization.
ja_jp: この大きなプロジェクトは、OSPO の親組織にとって重要な戦略的・技術的役割も担っています。

source: The company does monitor contributions and is looking to install metrics around OSS participation as part of the OSPO’s management objectives.
ja_jp: 同社はコントリビューションをモニタリングしており、OSPO の管理目標の一部として、OSSへの参加に関するメトリックの設定を、今検討しています。

source: The company has a stated goal of moving away from reliance on suppliers for software to power components and towards internal development.
ja_jp: 今同社は、コンポーネントを強化するためにもソフトウェア サプライヤの依存から脱却し、内製開発へと移行するという、明確な目標を掲げています。

source: The company has also stepped up promotion of its open source efforts in media and through code school sponsorships, where Peters is giving frequent keynote talks.
ja_jp: 同社はまた、メディアやコーディングスクール ― Peters氏がよく基調講演をします ― へのスポンサーシップを通じ、オープンソースの取り組みのプロモーション強化も行ってきました。

source: The company has thousands of technologists, many of whom touch open source as part of their development workflow.
ja_jp: 同社には何千人もの技術者がおり、その多くは開発ワークフローの中の一部でオープンソースと接しています。

source: The company recognized that it would be better served with a unified open source compliance and license strategy, as well as one set of tooling to simplify compliance.
ja_jp: 同社は、統一されたオープンソース コンプライアンスやライセンスの戦略を、一連のツールセット ― コンプライアンスをシンプルにするツールたち ― と併せ社内へ提供する方のがより好ましいだろうことを認識しました。

source: The decline might also relate to economic and staffing challenges due to COVID-19.
ja_jp: また、この低下が、COVID-19 による経済的および人員確保の課題にも関係している可能性もあります。

source: The emphasis on developer relations and engagement increased external contributions to in-house open source projects from 38% to 47%, among several positive metrics associated with ecosystem participation and evangelism.
ja_jp: 開発者との関係とエンゲージメントを重要視していることが、社内で使用しているオープンソース プロジェクトへの外部コントリビューションを38%から47%へ増加させることに繋がったことが挙げられます。外部コントリビューションは（オープンソース）エコシステムへの参画と普及活動に関連するいくつかの肯定的メトリックの中の一つです。

source: The expectation of a successful OSPO will transition from educating developers or marshaling code contributions to adding meaningful strategic value and driving higher level open source strategy, innovation, and developer efficiency.
ja_jp: 成功する OSPO に対する期待は、開発者たちの教育やコード コントリビューションの統制といった役割から、意味のある戦略的価値の付加、より高次のオープンソース戦略、イノベーションそして開発者の効率性といったことをドライブする役割へと変化していくことでしょう。

source: The final data set included responses from 1,141 survey participants.
ja_jp: 最終データセットには、調査参加者1,141人からの回答が含まれていました。

source: The first goal is to make it as frictionless as possible for Comcast developers to consume, contribute, comply with, work on, and create open source.
ja_jp: 第一の目標は、Comcast の開発者たちがオープンソースに対する使用、コントリビューション、コンプライアンス、影響、創出といったことについて、できる限り摩擦のないようにしていくことです。

source: The first stage of formal consumption and compliance of the OSPO maturity cycle at Comcast started years ago, when more formal policies and processes were put in place by some legal and development leaders to address the increasing consumption and contribution.
ja_jp: Comcast では、OSPO の成熟サイクルとしての最初のステージとして「正式な形での消費やコンプライアンス」の段階が数年前に始まりました。この時点では、（OSSの）消費やコントリビューションの増加に対応するために、一部の法務および開発リーダーたちによって、より正式な形でポリシーとプロセスが導入されています。

source: The formal approval processes for introducing new OSS products
ja_jp: 新しいOSS製品を導入するための正式な承認プロセス

source: The formation of OSPOs can be analogous to when organizations first started to establish CISOs as a reaction to security incidents.
ja_jp: OSPO の形成は、組織がセキュリティ インシデントへの対応として CISO から立ち上げはじめた頃と似ているとも言えそうです。

source: The group now claims several full-time employees, and coordinators operating in multiple product groups across the automotive firm.
ja_jp: この OSPO には現在、数名のフルタイム社員と、同社横断的な製品グループを運営するコーディネーターたちが存在すると言います。

source: The job description of the OSPO at Comcast needed to be broader than compliance and needed to include continued fostering of code contributions back to the community,” says Ruff.
ja_jp: Comcast における OSPO の職務は、コンプライアンスだけでなく、コミュニティへのコード コントリビューションも継続的な推進も必要とされました。」と、Ruff は言います。

source: The key duties of an OSPO shifted somewhat.
ja_jp: OSPOとしての主だった責務に少し変化が見られました。

source: The largest increases in the percentage of respondents by industry were government, education, and retail.
ja_jp: 業種別では、政府機関、教育、小売で最も大きな増加が見られました。

source: The legal team and technology leadership tend to push for an inventory of all OSS in use in an organization.
ja_jp: 法務チームと技術リーダーは、組織内で使用されているすべての OSS についてインベントリを強く求める傾向があります。

source: The makeup of respondents differed slightly from previous years, with more describing themselves as “self-employed” or “not working.” In the 2021 survey, fewer respondents worked for tech companies than in previous years.
ja_jp: また2021年の調査では、テック系企業で働いている回答者数がこれまでに比較し減少しています。

source: The model is general: The size and the type of the organization affect how the OSPO matures.
ja_jp: このモデルは一般的なもので、組織の規模や種類は、その OSPO がどれだけ成熟しているのかということに作用してきます。

source: The most prominent of these is the Affero General Public License (AGPL).
ja_jp: その中で最も際立ったものが、Affero General Public License（AGPL）です。

source: The nuances of different license types
ja_jp: 異なるライセンスタイプの微妙な違い

source: The organization has a formal policy around the use and production of OSS.
ja_jp: その組織が、OSS の使用や稼働に関して正式なポリシーを持っている

source: The organizations that established these centers of security competency protected and armed themselves for a better future.
ja_jp: このようなセキュリティ コンピテンシーの中心的機構を確立した組織は、さらに良い未来に向け、自らを守り、武装するようになりました。

source: The overhead and commitment level for such projects are high.
ja_jp: このようなプロジェクトのオーバーヘッドやコミットメント レベルは高くなります。

source: The pace of release of significant open source projects has recently accelerated at Bloomberg, often driven by its active approach to build multi-organization collaborations that share the work and generate more momentum.
ja_jp: Bloomberg では、重要なオープンソースプロジェクトをリリースするペースが昨今加速していますが、背景では、複数組織でのコラボレーションの形を築き、作業を共有し、さらなる勢いを生み出すという積極的アプローチがしばしば取られ、推進されているのです。

source: The process is nuanced and takes into account many factors.
ja_jp: プロセスには微妙な差異があり、多くの要素が考慮されています。

source: The process of requesting and getting approval for outbound participation is usually ad hoc and painful in the early days.
ja_jp: アウトバウンドでの参加を要請し承認を得るプロセスは、通常場当たり的で、早期では痛みを伴うものでもあります。
